# Найти и вывести на экран квадраты и кубы чисел от 2 до 5.
for i in range(2, 6):
    print(f"{i}^2 = {i ** 2}, {i}^3 = {i ** 3}")
